{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Doctorate of Computer Science",
      "department": "Computer Science",
      "duration": "2014-2019",
      "school_name": "University of Western Ontario"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Computer Science",
      "department": "Computer Science",
      "duration": "2011-2013",
      "school_name": "University of Western Ontario"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Computer Science",
      "department": "Computer Science",
      "duration": "2005-2010",
      "school_name": "Sharif University of Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NasimSamei",
  "highlighted_projects": [
    {
      "description": "In this project, I have examined different features such as global histogram, local histogram, SIFT and HoG for detecting a pedestrian in an image and then for classification I have trained different classifiers such as Knn and linear-SVM and Kernel-SVM. The goal of this project was to suggest a robust feature with an appropriate classifier.",
      "name": "Pedestrian Detection"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The goal of this project is to monitor each Linux node usage statistics within a Linux cluster. The project includes a series of bash scripts to create and start a PSQL instance within a docker container. Subsequently, by using crontab it automatically collects usage statistics and inserts them into a DB called host_agent in the docker container every minute. ",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Nasim Samei",
  "others": [
    {
      "bullets": [
        "Certified speech crafter from Toastmaster's international"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "I am a member of the Toastmasters International Club improving my communication and leadership skills",
        "I was a member of the Badminton Club during my grad studies at Western University",
        "Volunteer, assisting with the organization of membership supportive project at Toastmasters International to help new members gain more courage and confidence"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "I worked on a project called Cluster Monitoring. Technologies: Linux/Bash scripting, SQL, and Git. Currently, I am working on a data analytics project using Python and Pandas.",
      "duration": "2022-present",
      "title": "Data Engineer"
    },
    {
      "company": "IST Austria",
      "description": "The project was a bridge between optimization and machine learning. I have developed a program that learns a submodular function, max cut problem, from data by training a neural network using a technique called combinatorial black-box solver. The neural network model I used was the RBF Kernel of a Project Matrix. Also, I used a greedy algorithm to solve the max cut problem. Technologies: Pytorch, Python, Gurobi Optimize",
      "duration": "2020",
      "title": "Postdoctoral Researcher"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "JaveScript",
      "HTML",
      "Matlab",
      "Scikit-learn",
      "Computer Vision"
    ],
    "familiar": [
      "Deep Learning",
      "Pyspark",
      "Reinforcement Learning",
      "Seaborn",
      "Matplotlib"
    ],
    "proficient": [
      "Java",
      "python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Numpy"
    ]
  },
  "summary": "I have received my Ph.D. degree from the University of Western Ontario. After graduation, I spent a year in Austria as a postdoc researcher. My research mainly focuses on designing efficient algorithms for optimization problems. After my postdoc, I realized I am interested in engaging myself in a more practical environment. I am eager to use my strong problem-solving potential and creativity to solve real-life problems practically. I think a scientific mindset is a great asset that can assist me in writing meaningful programs. Because I believe coding is different from programming. Programs are built upon creative ideas.  Before you start coding you need to have a clear picture of what the problem is and what the program suppose to do.  Next, we need to determine how to design the program to satisfy the defined duty. We have to determine appropriate data structures and the number of entities involved to define our classes."
}
